xiangquan3721/Bunka_STM8L051F3_TX_Source/radio/cmt2300a_defs.h
/*
 * THE FOLLOWING FIRMWARE IS PROVIDED: (1) "AS IS" WITH NO WARRANTY; AND
 * (2)TO ENABLE ACCESS TO CODING INFORMATION TO GUIDE AND FACILITATE CUSTOMER.
 * CONSEQUENTLY, CMOSTEK SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT
 * OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION
 * CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * Copyright (C) CMOSTEK SZ.
 */

/*!
 * @file    cmt2300a_defs.h
 * @brief   CMT2300A registers defines
 *
 * @version 1.2
 * @date    Jul 17 2017
 * @author  CMOSTEK R@D
 */

#ifndef __CMT2300A_DEFS_H
#define __CMT2300A_DEFS_H

/* ---------- CMT bank defines ---------- */
#define CMT2300A_CMT_BANK_ADDR           0x00
#define CMT2300A_CMT_BANK_SIZE           12
#define CMT2300A_CUS_CMT1                0x00
#define CMT2300A_CUS_CMT2                0x01
#define CMT2300A_CUS_CMT3                0x02
#define CMT2300A_CUS_CMT4                0x03
#define CMT2300A_CUS_CMT5                0x04
#define CMT2300A_CUS_CMT6                0x05
#define CMT2300A_CUS_CMT7                0x06
#define CMT2300A_CUS_CMT8                0x07
#define CMT2300A_CUS_CMT9                0x08
#define CMT2300A_CUS_CMT10               0x09
#define CMT2300A_CUS_CMT11               0x0A
#define CMT2300A_CUS_RSSI                0x0B

/* ---------- System bank defines ---------- */
#define CMT2300A_SYSTEM_BANK_ADDR        0x0C
#define CMT2300A_SYSTEM_BANK_SIZE        12
#define CMT2300A_CUS_SYS1                0x0C
#define CMT2300A_CUS_SYS2                0x0D
#define CMT2300A_CUS_SYS3                0x0E
#define CMT2300A_CUS_SYS4                0x0F
#define CMT2300A_CUS_SYS5                0x10
#define CMT2300A_CUS_SYS6                0x11
#define CMT2300A_CUS_SYS7                0x12
#define CMT2300A_CUS_SYS8                0x13
#define CMT2300A_CUS_SYS9                0x14
#define CMT2300A_CUS_SYS10               0x15
#define CMT2300A_CUS_SYS11               0x16
#define CMT2300A_CUS_SYS12               0x17

/* ---------- Frequency bank defines ---------- */
#define CMT2300A_FREQUENCY_BANK_ADDR     0x18
#define CMT2300A_FREQUENCY_BANK_SIZE     8
#define CMT2300A_CUS_RF1                 0x18
#define CMT2300A_CUS_RF2                 0x19
#define CMT2300A_CUS_RF3                 0x1A
#define CMT2300A_CUS_RF4                 0x1B
#define CMT2300A_CUS_RF5                 0x1C
#define CMT2300A_CUS_RF6                 0x1D
#define CMT2300A_CUS_RF7                 0x1E
#define CMT2300A_CUS_RF8                 0x1F

/* ---------- Data rate bank defines ---------- */
#define CMT2300A_DATA_RATE_BANK_ADDR     0x20
#define CMT2300A_DATA_RATE_BANK_SIZE     24
#define CMT2300A_CUS_RF9                 0x20
#define CMT2300A_CUS_RF10                0x21
#define CMT2300A_CUS_RF11                0x22
#define CMT2300A_CUS_RF12                0x23
#define CMT2300A_CUS_FSK1                0x24
#define CMT2300A_CUS_FSK2                0x25
#define CMT2300A_CUS_FSK3                0x26
#define CMT2300A_CUS_FSK4                0x27
#define CMT2300A_CUS_FSK5                0x28
#define CMT2300A_CUS_FSK6                0x29
#define CMT2300A_CUS_FSK7                0x2A
#define CMT2300A_CUS_CDR1                0x2B
#define CMT2300A_CUS_CDR2                0x2C
#define CMT2300A_CUS_CDR3                0x2D
#define CMT2300A_CUS_CDR4                0x2E
#define CMT2300A_CUS_AGC1                0x2F
#define CMT2300A_CUS_AGC2                0x30
#define CMT2300A_CUS_AGC3                0x31
#define CMT2300A_CUS_AGC4                0x32
#define CMT2300A_CUS_OOK1                0x33
#define CMT2300A_CUS_OOK2                0x34
#define CMT2300A_CUS_OOK3                0x35
#define CMT2300A_CUS_OOK4                0x36
#define CMT2300A_CUS_OOK5                0x37

/* ---------- Baseband bank defines ---------- */
#define CMT2300A_BASEBAND_BANK_ADDR      0x38
#define CMT2300A_BASEBAND_BANK_SIZE      29
#define CMT2300A_CUS_PKT1                0x38
#define CMT2300A_CUS_PKT2                0x39
#define CMT2300A_CUS_PKT3                0x3A
#define CMT2300A_CUS_PKT4                0x3B
#define CMT2300A_CUS_PKT5                0x3C
#define CMT2300A_CUS_PKT6                0x3D
#define CMT2300A_CUS_PKT7                0x3E
#define CMT2300A_CUS_PKT8                0x3F
#define CMT2300A_CUS_PKT9                0x40
#define CMT2300A_CUS_PKT10               0x41
#define CMT2300A_CUS_PKT11               0x42
#define CMT2300A_CUS_PKT12               0x43
#define CMT2300A_CUS_PKT13               0x44
#define CMT2300A_CUS_PKT14               0x45
#define CMT2300A_CUS_PKT15               0x46
#define CMT2300A_CUS_PKT16               0x47
#define CMT2300A_CUS_PKT17               0x48
#define CMT2300A_CUS_PKT18               0x49
#define CMT2300A_CUS_PKT19               0x4A
#define CMT2300A_CUS_PKT20               0x4B
#define CMT2300A_CUS_PKT21               0x4C
#define CMT2300A_CUS_PKT22               0x4D
#define CMT2300A_CUS_PKT23               0x4E
#define CMT2300A_CUS_PKT24               0x4F
#define CMT2300A_CUS_PKT25               0x50
#define CMT2300A_CUS_PKT26               0x51
#define CMT2300A_CUS_PKT27               0x52
#define CMT2300A_CUS_PKT28               0x53
#define CMT2300A_CUS_PKT29               0x54

/* ---------- Tx bank defines ---------- */
#define CMT2300A_TX_BANK_ADDR            0x55
#define CMT2300A_TX_BANK_SIZE            11
#define CMT2300A_CUS_TX1                 0x55
#define CMT2300A_CUS_TX2                 0x56
#define CMT2300A_CUS_TX3                 0x57
#define CMT2300A_CUS_TX4                 0x58
#define CMT2300A_CUS_TX5                 0x59
#define CMT2300A_CUS_TX6                 0x5A
#define CMT2300A_CUS_TX7                 0x5B
#define CMT2300A_CUS_TX8                 0x5C
#define CMT2300A_CUS_TX9                 0x5D
#define CMT2300A_CUS_TX10                0x5E
#define CMT2300A_CUS_LBD                 0x5F

/* ---------- Control1 bank defines ---------- */
#define CMT2300A_CONTROL1_BANK_ADDR      0x60
#define CMT2300A_CONTROL1_BANK_SIZE      11
#define CMT2300A_CUS_MODE_CTL            0x60
#define CMT2300A_CUS_MODE_STA            0x61
#define CMT2300A_CUS_EN_CTL              0x62
#define CMT2300A_CUS_FREQ_CHNL           0x63
#define CMT2300A_CUS_FREQ_OFS            0x64
#define CMT2300A_CUS_IO_SEL              0x65
#define CMT2300A_CUS_INT1_CTL            0x66
#define CMT2300A_CUS_INT2_CTL            0x67
#define CMT2300A_CUS_INT_EN              0x68
#define CMT2300A_CUS_FIFO_CTL            0x69
#define CMT2300A_CUS_INT_CLR1            0x6A

/* ---------- Control2 bank defines ---------- */
#define CMT2300A_CONTROL2_BANK_ADDR      0x6B
#define CMT2300A_CONTROL2_BANK_SIZE      7
#define CMT2300A_CUS_INT_CLR2            0x6B
#define CMT2300A_CUS_FIFO_CLR            0x6C
#define CMT2300A_CUS_INT_FLAG            0x6D
#define CMT2300A_CUS_FIFO_FLAG           0x6E
#define CMT2300A_CUS_RSSI_CODE           0x6F
#define CMT2300A_CUS_RSSI_DBM            0x70
#define CMT2300A_CUS_LBD_RESULT          0x71


/* ********** CMT2300A_CUS_CMT2 registers ********** */
#define CMT2300A_MASK_PRODUCT_ID         0xFF

/* ********** CMT2300A_CUS_CMT5 registers ********** */
#define CMT2300A_MASK_LMT_CODE           0xC0

/* ********** CMT2300A_CUS_CMT9 registers ********** */
#define CMT2300A_MASK_RSSI_OFFSET_SIGN   0x80
#define CMT2300A_MASK_DIG_CLKDIV         0x1F

/* ********** CMT2300A_CUS_RSSI registers ********** */
#define CMT2300A_MASK_RSSI_OFFSET        0xF8
#define CMT2300A_MASK_RSSI_SLOPE         0x07

