xiangquan3721/Bunka_STM8L051F3_TX_Source/radio/cmt2300a_defs.h
/* ********** CMT2300A_CUS_SYS1 registers ********** */
#define CMT2300A_MASK_LMT_VTR            0xC0
#define CMT2300A_MASK_MIXER_BIAS         0x30
#define CMT2300A_MASK_LNA_MODE           0x0C
#define CMT2300A_MASK_LNA_BIAS           0x03

/* ********** CMT2300A_CUS_SYS2 registers ********** */
#define CMT2300A_MASK_LFOSC_RECAL_EN     0x80
#define CMT2300A_MASK_LFOSC_CAL1_EN      0x40
#define CMT2300A_MASK_LFOSC_CAL2_EN      0x20
#define CMT2300A_MASK_RX_TIMER_EN        0x10
#define CMT2300A_MASK_SLEEP_TIMER_EN     0x08
#define CMT2300A_MASK_TX_DC_EN           0x04
#define CMT2300A_MASK_RX_DC_EN           0x02
#define CMT2300A_MASK_DC_PAUSE           0x01

/* ********** CMT2300A_CUS_SYS3 registers ********** */
#define CMT2300A_MASK_SLEEP_BYPASS_EN    0x80
#define CMT2300A_MASK_XTAL_STB_TIME      0x70
#define CMT2300A_MASK_TX_EXIT_STATE      0x0C
#define CMT2300A_MASK_RX_EXIT_STATE      0x03

/* ********** CMT2300A_CUS_SYS4 registers ********** */
#define CMT2300A_MASK_SLEEP_TIMER_M_7_0  0xFF

/* ********** CMT2300A_CUS_SYS5 registers ********** */
#define CMT2300A_MASK_SLEEP_TIMER_M_10_8 0x70
#define CMT2300A_MASK_SLEEP_TIMER_R      0x0F

/* ********** CMT2300A_CUS_SYS6 registers ********** */
#define CMT2300A_MASK_RX_TIMER_T1_M_7_0  0xFF

/* ********** CMT2300A_CUS_SYS7 registers ********** */
#define CMT2300A_MASK_RX_TIMER_T1_M_10_8 0x70
#define CMT2300A_MASK_RX_TIMER_T1_R      0x0F

/* ********** CMT2300A_CUS_SYS8 registers ********** */
#define CMT2300A_MASK_RX_TIMER_T2_M_7_0  0xFF

/* ********** CMT2300A_CUS_SYS9 registers ********** */
#define CMT2300A_MASK_RX_TIMER_T2_M_10_8 0x70
#define CMT2300A_MASK_RX_TIMER_T2_R      0x0F

/* ********** CMT2300A_CUS_SYS10 registers ********** */
#define CMT2300A_MASK_COL_DET_EN         0x80
#define CMT2300A_MASK_COL_OFS_SEL        0x40
#define CMT2300A_MASK_RX_AUTO_EXIT_DIS   0x20
#define CMT2300A_MASK_DOUT_MUTE          0x10
#define CMT2300A_MASK_RX_EXTEND_MODE     0x0F

/* ********** CMT2300A_CUS_SYS11 registers ********** */
#define CMT2300A_MASK_PJD_TH_SEL         0x80
#define CMT2300A_MASK_CCA_INT_SEL        0x60
#define CMT2300A_MASK_RSSI_DET_SEL       0x18
#define CMT2300A_MASK_RSSI_AVG_MODE      0x07

/* ********** CMT2300A_CUS_SYS12 registers ********** */
#define CMT2300A_MASK_PJD_WIN_SEL        0xC0
#define CMT2300A_MASK_CLKOUT_EN          0x20
#define CMT2300A_MASK_CLKOUT_DIV         0x1F

/* ********** CMT2300A_CUS_RF1 registers ********** */
#define CMT2300A_MASK_FREQ_RX_N          0xFF

/* ********** CMT2300A_CUS_RF2 registers ********** */
#define CMT2300A_MASK_FREQ_RX_K_7_0      0xFF

/* ********** CMT2300A_CUS_RF3 registers ********** */
#define CMT2300A_MASK_FREQ_RX_K_15_8     0xFF

/* ********** CMT2300A_CUS_RF4 registers ********** */
#define CMT2300A_MASK_FREQ_PALDO_SEL     0x80
#define CMT2300A_MASK_FREQ_DIVX_CODE     0x70
#define CMT2300A_MASK_FREQ_RX_K_19_16    0x0F

/* ********** CMT2300A_CUS_RF5 registers ********** */
#define CMT2300A_MASK_FREQ_TX_N          0xFF

/* ********** CMT2300A_CUS_RF6 registers ********** */
#define CMT2300A_MASK_FREQ_TX_K_7_0      0xFF

/* ********** CMT2300A_CUS_RF7 registers ********** */
#define CMT2300A_MASK_FREQ_TX_K_15_8     0xFF

/* ********** CMT2300A_CUS_RF8 registers ********** */
#define CMT2300A_MASK_FSK_SWT            0x80
#define CMT2300A_MASK_FREQ_VCO_BANK      0x70
#define CMT2300A_MASK_FREQ_TX_K_19_16    0x0F

/* ********** CMT2300A_CUS_PKT1 registers ********** */
#define CMT2300A_MASK_RX_PREAM_SIZE      0xF8
#define CMT2300A_MASK_PREAM_LENG_UNIT    0x04
#define CMT2300A_MASK_DATA_MODE          0x03
/* CMT2300A_MASK_PREAM_LENG_UNIT options */
#define CMT2300A_PREAM_LENG_UNIT_8_BITS  0x00
#define CMT2300A_PREAM_LENG_UNIT_4_BITS  0x04
/* CMT2300A_MASK_DATA_MODE options */
#define CMT2300A_DATA_MODE_DIRECT        0x00
#define CMT2300A_DATA_MODE_PACKET        0x02

/* ********** CMT2300A_CUS_PKT2 registers ********** */
#define CMT2300A_MASK_TX_PREAM_SIZE_7_0  0xFF

/* ********** CMT2300A_CUS_PKT3 registers ********** */
#define CMT2300A_MASK_TX_PREAM_SIZE_15_8 0xFF

/* ********** CMT2300A_CUS_PKT4 registers ********** */
#define CMT2300A_MASK_PREAM_VALUE        0xFF

/* ********** CMT2300A_CUS_PKT5 registers ********** */
#define CMT2300A_MASK_SYNC_TOL           0x70
#define CMT2300A_MASK_SYNC_SIZE          0x0E
#define CMT2300A_MASK_SYNC_MAN_EN        0x01

/* ********** CMT2300A_CUS_PKT6 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_7_0     0xFF

/* ********** CMT2300A_CUS_PKT7 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_15_8    0xFF

/* ********** CMT2300A_CUS_PKT8 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_23_16   0xFF

/* ********** CMT2300A_CUS_PKT9 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_31_24   0xFF

/* ********** CMT2300A_CUS_PKT10 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_39_32   0xFF

/* ********** CMT2300A_CUS_PKT11 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_47_40   0xFF

/* ********** CMT2300A_CUS_PKT12 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_55_48   0xFF

/* ********** CMT2300A_CUS_PKT13 registers ********** */
#define CMT2300A_MASK_SYNC_VALUE_63_56   0xFF

/* ********** CMT2300A_CUS_PKT14 registers ********** */
#define CMT2300A_MASK_PAYLOAD_LENG_10_8  0x70
#define CMT2300A_MASK_AUTO_ACK_EN        0x08
#define CMT2300A_MASK_NODE_LENG_POS_SEL  0x04
#define CMT2300A_MASK_PAYLOAD_BIT_ORDER  0x02
#define CMT2300A_MASK_PKT_TYPE           0x01
/* CMT2300A_MASK_NODE_LENG_POS_SEL options */
#define CMT2300A_NODE_LENG_FIRST_NODE    0x00
#define CMT2300A_NODE_LENG_FIRST_LENGTH  0x04
/* CMT2300A_MASK_PAYLOAD_BIT_ORDER options */
#define CMT2300A_PAYLOAD_BIT_ORDER_MSB   0x00
#define CMT2300A_PAYLOAD_BIT_ORDER_LSB   0x02
/* CMT2300A_MASK_PKT_TYPE options */
#define CMT2300A_PKT_TYPE_FIXED          0x00
#define CMT2300A_PKT_TYPE_VARIABLE       0x01

/* ********** CMT2300A_CUS_PKT15 registers ********** */
#define CMT2300A_MASK_PAYLOAD_LENG_7_0   0xFF

/* ********** CMT2300A_CUS_PKT16 registers ********** */
#define CMT2300A_MASK_NODE_FREE_EN       0x20
#define CMT2300A_MASK_NODE_ERR_MASK      0x10
#define CMT2300A_MASK_NODE_SIZE          0x0C
#define CMT2300A_MASK_NODE_DET_MODE      0x03
/* CMT2300A_MASK_NODE_DET_MODE options */
#define CMT2300A_NODE_DET_NODE           0x00
#define CMT2300A_NODE_DET_VALUE          0x01
#define CMT2300A_NODE_DET_VALUE_0        0x02
#define CMT2300A_NODE_DET_VALUE_0_1      0x03

/* ********** CMT2300A_CUS_PKT17 registers ********** */
#define CMT2300A_MASK_NODE_VALUE_7_0     0xFF

/* ********** CMT2300A_CUS_PKT18 registers ********** */
#define CMT2300A_MASK_NODE_VALUE_15_8    0xFF

